---
kind: type
id: T:Autodesk.Revit.DB.JoinType
source: html/ca8395f6-d268-9296-5428-65d06fb34970.htm
---
# Autodesk.Revit.DB.JoinType

The type of join at the end of an element. The join type affects only the graphic treatment, i.e.
cleaning of the end, not the physical join behavior.

## Syntax (C#)
```csharp
public enum JoinType
```